ХамелионЦРПТ/src/InformationRegisters/ХН_СоответствиеОперациямВводВОборот/ХН_СоответствиеОперациямВводВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХН_СоответствиеОперациямВводВОборот</name>
  <resources>
    <name>ОтчетОбИспользовании</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <dimensions>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ХН_СоответствиеОперациямВводВОборот/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.ОтчетОбИспользовании) И НЕ ТипЗнч(Запись.ОтчетОбИспользовании) = Тип("ДокументСсылка.ВводВОборот_ХамелеонЦРПТ") Тогда
			Продолжить;
		КонецЕсли;	
		
		МассивИсключений = Новый Массив;
		МассивИсключений.Добавить(Запись.ВводВОборот);
		
		СписокВводВОборот = РегистрыСведений.ХН_СоответствиеОперациямВводВОборот.ВводВоборотПоОтчетОбИспользовании(Запись.ОтчетОбИспользовании, МассивИсключений);
		
		Если СписокВводВОборот.Количество() Тогда
			
			ЕстьПроведенный = Ложь;
			Для Каждого ТО из СписокВводВОборот Цикл
				Если ТО.Проведен Тогда
					ЕстьПроведенный = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ЕстьПроведенный Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ОтчетОбИспользовании : " + Запись.ОтчетОбИспользовании + " 
																|уже установлено соответствие 
																|с Вводом В Оборот: " + СписокВводВОборот[0] + "!");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ОтчетОбИспользовании : " + Запись.ОтчетОбИспользовании + " 
																|уже установлено соответствие 
																|с Вводом В Оборот: " + СписокВводВОборот[0] + ". Новый документ не будет записан!",,,,Отказ);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
